import React from 'react'
import { Article } from '../Article'
import { Section } from '../Section'
import { Title } from '../Title'
import s from './index.module.css'

export const WhatIs: React.FC = () => {
    return (
        <div className={s.bg}>
            <Section className={s.container}>
                <svg width="174" height="174" viewBox="0 0 174 174" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M79.6308 100.184C79.6308 97.0933 79.9154 94.45 80.4848 92.254C81.1354 89.9767 82.1928 87.8213 83.6568 85.788C85.2021 83.7547 87.2761 81.64 89.8788 79.444C93.0508 76.76 95.4908 74.5233 97.1988 72.734C98.9881 70.9447 100.249 69.196 100.981 67.488C101.713 65.78 102.079 63.706 102.079 61.266C102.079 57.362 100.818 54.3527 98.2968 52.238C95.7755 50.1233 92.1155 49.066 87.3168 49.066C83.3314 49.066 79.7934 49.5947 76.7028 50.652C73.6121 51.628 70.6434 52.8073 67.7968 54.19L64.0148 45.65C67.2681 43.942 70.8468 42.5187 74.7508 41.38C78.7361 40.2413 83.1688 39.672 88.0488 39.672C95.7754 39.672 101.753 41.5833 105.983 45.406C110.212 49.2287 112.327 54.434 112.327 61.022C112.327 64.682 111.717 67.8133 110.497 70.416C109.358 72.9373 107.691 75.296 105.495 77.492C103.38 79.6067 100.859 81.884 97.9308 84.324C95.2468 86.6013 93.1728 88.594 91.7088 90.302C90.3261 92.01 89.3908 93.718 88.9028 95.426C88.4148 97.0527 88.1708 99.0453 88.1708 101.404V103.478H79.6308V100.184ZM76.8248 121.412C76.8248 118.403 77.5161 116.288 78.8988 115.068C80.3628 113.848 82.1928 113.238 84.3888 113.238C86.4221 113.238 88.1708 113.848 89.6348 115.068C91.0988 116.288 91.8308 118.403 91.8308 121.412C91.8308 124.34 91.0988 126.455 89.6348 127.756C88.1708 129.057 86.4221 129.708 84.3888 129.708C82.1928 129.708 80.3628 129.057 78.8988 127.756C77.5161 126.455 76.8248 124.34 76.8248 121.412Z" fill="white" />
                    <circle cx="87" cy="87" r="85.5" stroke="var(--color-red)" stroke-width="3" />
                </svg>
                <div className={s.text}>
                    <Title level={2} style={{ marginBottom: '2rem' }}>
                        что такое мастер-план?
                    </Title>
                    <Article>
                        <p>
                            Документ стратегического пространственного планирования города. Такое планирование носит долгосрочный характер и фокусируется на ограниченном числе целей и задач. Разрабатывается стратегический мастер-план публичной властью, но при активном участии экспертов и горожан.
                        </p>
                    </Article>
                </div>
            </Section>
        </div>
    )
}